<footer class="footer sm:footer-horizontal bg-base-200 text-xl-content p-10 pb-20">
    <aside>
        <a href="{{route('index')}}" class="text-2xl font-bold">Все танцы</a>
        <p>
            ИП: Пудикова Залия Мунировна
            <br/>
            ИНН: 027407674680
            <br/>
            ОГРНИП: 322028000160589
        </p>
    </aside>

    <nav>
        <h6 class="footer-title">Основное</h6>
        <a href="{{route('index')}}" class="link link-hover">Главная</a>
        <a href="{{route('groups')}}" class="link link-hover">Поиск</a>
        <a href="{{route('teachers')}}" class="link link-hover">Преподаватели</a>
        @auth
            <a href="{{route('profile')}}" class="link link-hover">Личный профиль</a>
        @endauth
    </nav>

    <nav>
        <h6 class="footer-title">Контакты</h6>
        <a href="https://yandex.ru/maps/?text=г.+Уфа,+ул.+Бульвар+Ибрагимова+88"
           class="link link-hover"
           target="_blank">
            г. Уфа, ул. Бульвар Ибрагимова 88, 1 этаж
        </a>
        <a href="tel:+79177532370" class="link link-hover">+7 917 753 2370</a>
        <a href="mailto:info@vsetancy.ru" class="link link-hover">info@vsetancy.ru</a>
    </nav>

    <nav>
        <h6 class="footer-title">Связаться с нами</h6>

        <a href="https://t.me/vsetancy" target="_blank" class="link link-hover flex items-center gap-2">
        <span class="[&>svg]:h-7 [&>svg]:w-7 [&>svg]:fill-[#5e5e5e]">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512">
                <path
                    d="M248 8C111 8 0 119 0 256S111 504 248 504 496 393 496 256 385 8 248 8zM363 176.7c-3.7 39.2-19.9 134.4-28.1 178.3-3.5 18.6-10.3 24.8-16.9 25.4-14.4 1.3-25.3-9.5-39.3-18.7-21.8-14.3-34.2-23.2-55.3-37.2-24.5-16.1-8.6-25 5.3-39.5 3.7-3.8 67.1-61.5 68.3-66.7 .2-.7 .3-3.1-1.2-4.4s-3.6-.8-5.1-.5q-3.3 .7-104.6 69.1-14.8 10.2-26.9 9.9c-8.9-.2-25.9-5-38.6-9.1-15.5-5-27.9-7.7-26.8-16.3q.8-6.7 18.5-13.7 108.4-47.2 144.6-62.3c68.9-28.6 83.2-33.6 92.5-33.8 2.1 0 6.6 .5 9.6 2.9a10.5 10.5 0 0 1 3.5 6.7A43.8 43.8 0 0 1 363 176.7z"/>
            </svg>
        </span>
            <span>Telegram</span>
        </a>

        <a href="https://wa.me/79173669857" target="_blank" class="link link-hover flex items-center gap-2">
        <span class="[&>svg]:h-7 [&>svg]:w-7 [&>svg]:fill-[#5e5e5e]">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 50 50">
                <path
                    d="M 25 2 C 12.318 2 2 12.318 2 25 C 2 28.96 3.0228906 32.853062 4.9628906 36.289062 L 2.0371094 46.730469 C 1.9411094 47.073469 2.03325 47.440312 2.28125 47.695312 C 2.47225 47.892313 2.733 48 3 48 C 3.08 48 3.1612344 47.989703 3.2402344 47.970703 L 14.136719 45.271484 C 17.463719 47.057484 21.21 48 25 48 C 37.682 48 48 37.682 48 25 C 48 12.318 37.682 2 25 2 z M 16.642578 14 C 17.036578 14 17.428437 14.005484 17.773438 14.021484 C 18.136437 14.039484 18.624516 13.883484 19.103516 15.021484 C 19.595516 16.189484 20.775875 19.058563 20.921875 19.351562 C 21.069875 19.643563 21.168656 19.984047 20.972656 20.373047 C 20.776656 20.762047 20.678813 21.006656 20.382812 21.347656 C 20.086813 21.688656 19.762094 22.107141 19.496094 22.369141 C 19.200094 22.660141 18.892328 22.974594 19.236328 23.558594 C 19.580328 24.142594 20.765484 26.051656 22.521484 27.597656 C 24.776484 29.583656 26.679531 30.200188 27.269531 30.492188 C 27.859531 30.784188 28.204828 30.734703 28.548828 30.345703 C 28.892828 29.955703 30.024969 28.643547 30.417969 28.060547 C 30.810969 27.477547 31.204094 27.572578 31.746094 27.767578 C 32.288094 27.961578 35.19125 29.372062 35.78125 29.664062 C 36.37125 29.956063 36.766062 30.102703 36.914062 30.345703 C 37.062062 30.587703 37.062312 31.754234 36.570312 33.115234 C 36.078313 34.477234 33.717984 35.721672 32.583984 35.888672 C 31.565984 36.037672 30.277281 36.10025 28.863281 35.65625 C 28.006281 35.38625 26.907047 35.028734 25.498047 34.427734 C 19.575047 31.901734 15.706156 26.012047 15.410156 25.623047 C 15.115156 25.234047 13 22.46275 13 19.59375 C 13 16.72475 14.524406 15.314469 15.066406 14.730469 C 15.608406 14.146469 16.248578 14 16.642578 14 z"/>
            </svg>
        </span>
            <span>WhatsApp</span>
        </a>
    </nav>

    <nav>
        <a class="link link-hover">Пользовательское соглашение</a>
        <a class="link link-hover">Политика конфиденциальности</a>
    </nav>

</footer>
